#R можно использовать как калькулятор:3

2+2 # Сложение.

10-5 # Вычитание.

10*99 # Умножение.

225/15 # Деление, результат - целочисленный.

10/4 # Деление, результат - действительное число.

11%/%3 # Целая часть от деления.

11%%3 # Остаток от деления.

5^2 # Возведение в степень(1 вариант).

5**2 # Возведение в степень(2 вариант).

pi # Число Пи.

cos(pi) # Косинус.

sin(pi) # Синус.

exp(1) # Экспонента.

tan(0) # Тангентс.

abs(-5) # Модуль.

sqrt(144) #Корень.

round(3.4865,2) #Округление.

# Рассказать про Tab.

factorial(10) # Факториал.

# Рассказать про плюсик в консоле. 
